In [1]:
import pandas as pd

# Load the cleaned review data
df = pd.read_csv("../data/cleaned_reviews.csv")  # Use "../" if you're in notebooks/
df.head()

,review,rating,date,bank,source
0,መቸሸጠ,5,2025-06-03,Dashen Bank,Google Play
1,wow,5,2025-06-03,Dashen Bank,Google Play
2,gadaa,5,2025-06-01,Dashen Bank,Google Play
3,Massive upgrade from the Amole app.,5,2025-05-31,Dashen Bank,Google Play
4,good,4,2025-05-31,Dashen Bank,Google Play

In [2]:
# Count duplicated rows
print("Duplicates:", df.duplicated().sum())

Duplicates: 0

In [3]:
# Check for any missing data
df.isnull().sum()

review    0
rating    0
date      0
bank      0
source    0
dtype: int64

In [4]:
# Make sure all dates are in YYYY-MM-DD format
try:
    pd.to_datetime(df['date'], format="%Y-%m-%d", errors="raise")
    print(" Date format is valid (YYYY-MM-DD)")
except Exception as e:
    print(" Date format issue:", e)

✅ Date format is valid (YYYY-MM-DD)

In [5]:
# Check column order and names
print("Columns:", df.columns.tolist())

Columns: ['review', 'rating', 'date', 'bank', 'source']

In [6]:
df.info()
df.describe(include='all')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1407 entries, 0 to 1406
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   review  1407 non-null   object
 1   rating  1407 non-null   int64
 2   date    1407 non-null   object
 3   bank    1407 non-null   object
 4   source  1407 non-null   object
dtypes: int64(1), object(4)
memory usage: 55.1+ KB

,review,rating,date,bank,source
count,1407,1407.000000,1407,1407,1407
unique,1347,NaN,326,3,1
top,wow,NaN,2025-04-21,Commercial Bank of Ethiopia,Google Play
freq,3,NaN,110,500,1407
mean,NaN,3.703625,NaN,NaN,NaN
std,NaN,1.719152,NaN,NaN,NaN
min,NaN,1.000000,NaN,NaN,NaN
25%,NaN,2.000000,NaN,NaN,NaN
50%,NaN,5.000000,NaN,NaN,NaN
75%,NaN,5.000000,NaN,NaN,NaN
max,NaN,5.000000,NaN,NaN,NaN

In [7]:
df.isnull().sum()

review    0
rating    0
date      0
bank      0
source    0
dtype: int64